Repository: LittleFish-233/EncryptionAssistant
Catalog: EncryptionAssistant/String/*/cundang.resw
Source language: en_us
Languages: de, ja_jp, zh_cn, zh_hant

# button1.Content
source: Encoding
de: Verschlüsselung
ja_jp: 暗号化
zh_cn: 加密
zh_hant: 加密

# button2.Content
source: Decrypt
de: entschlüsseln
ja_jp: 解読する
zh_cn: 解密
zh_hant: 解密

# combobox.Header
source: Encryption/decryptmode:
de: Verschlüsselung/Entschlüsselungsmodus:
ja_jp: 暗号化/復号化モード:
zh_cn: 加密/解密模式：
zh_hant: 加密/解密模式：

# combobox1.Header
source: Encryption/decryption algorithm:
de: Verschlüsselungs-/Entschlüsselungsalgorithmus:
ja_jp: 暗号化/復号化アルゴリズム:
zh_cn: 加密/解密算法：
zh_hant: 加密/解密演算法：

# mccheckbox1.Content
source: Use the default encryption/decryption key (recommended)
de: Verwenden des Standardverschlüsselungs-/Entschlüsselungsschlüssels (empfohlen)
ja_jp: 既定の暗号化/復号化キーを使用する (推奨)
zh_cn: 使用默认加密/解密密匙（推荐）

# String1
source: Application with out of memory cannot encrypt files larger than (390MB), stay tuned for subsequent updates
de: Anwendung mit Nicht-Speicher kann Dateien, die größer als (390 MB) sind, nicht verschlüsseln, bleiben für nachfolgende Updates optimiert
ja_jp: メモリ不足のアプリケーションは(390MB)より大きいファイルを暗号化することはできません、その後の更新にご期待ください
zh_cn: 应用内存不足无法加密大于（390MB）的文件，敬请期待后续更新
zh_hant: 應用記憶體不足無法加密大於（390MB）的檔，敬請期待後續更新

# String10
source: Please go to the home page to decrypt this file<Version is higher than1.3.711>
de: Bitte gehen Sie zur Startseite, um diese Datei zu entschlüsseln<版本高于1.3.711>
ja_jp: このファイルを復号化するには、ホーム ページに移動してください。<版本高于1.3.711>
zh_cn: 请前往主页解密此文件<版本高于1.3.711>
zh_hant: 請前往主頁解密此檔<版本高於1.3.711>

# String11
source: Failed to read file version
de: Fehler beim Lesen der Dateiversion
ja_jp: ファイル のバージョンを読み取りできませんでした
zh_cn: 尝试读取文件版本失败
zh_hant: 嘗試讀取檔版本失敗

# String12
source: There is a problem decrypting, please ensure that the decryption key, decryption mode, decrypttheor algorithm correctness, check again. If you've seen this tip many times, please report this question to us in the Feedback Center, thank you
de: Es gibt ein Problem entschlüsseln, stellen Sie bitte sicher, dass der Entschlüsselungsschlüssel, Entschlüsselungsmodus, decrypttheor Algorithmus Korrektheit, überprüfen Sie erneut. Wenn Sie diesen Tipp schon oft gesehen haben, melden Sie uns diese Frage bitte im Feedback Center, danke
ja_jp: 復号化に問題がありますので、復号化キー、復号化モード、復号化アルゴリズムの正確性を確認し、もう一度確認してください。 このヒントを何度も見たことがある場合は、フィードバックセンターでこの質問を報告してください。
zh_cn: 解密时出现问题，请确保解密密匙，解密模式，解密算法的正确性，核对后请重试。如果你看到过这个提示很多次，请在反馈中心把这个问题报告给我们，谢谢
zh_hant: 解密時出現問題，請確保解密密匙，解密模式，解密演算法的正確性，核對後請重試。 如果你看到過這個提示很多次，請在回饋中樞把這個問題報告給我們，謝謝

# String13
source: Decryptsuccessful, click on the picture below to save
de: Decryptsuccessful, klicken Sie auf das Bild unten zu speichern
ja_jp: 復号化に成功し、下の写真をクリックして保存してください。
zh_cn: 解密成功，点击下面的图片保存
zh_hant: 解密成功，點擊下面的圖片保存

# String14
source: Please click on the picture above to select the file to decrypt
de: Bitte klicken Sie auf das Bild oben, um die zu entschlüsselnde Datei auszuwählen
ja_jp: 復号化に成功し、下の写真をクリックして保存してください。 ...
zh_cn: 请点击上面的图片选择要进行解密的文件
zh_hant: 請點擊上面的圖片選擇要進行解密的檔

# String15
source: There was a problem saving the results, please try again. If this prompt still appears after trying again many times, please feed us back to this issue and we will try our best to resolve it, thank you
de: Es ist ein Problem beim Speichern der Ergebnisse vorliegt, versuchen Sie es bitte erneut. Wenn diese Eingabeaufforderung immer noch erscheint, nachdem Sie es noch viele Male versucht haben, füttern Sie uns bitte zurück zu diesem Problem und wir werden unser Bestes tun, um es zu lösen, danke
ja_jp: 結果の保存に問題がありましたので、もう一度やり直してください。 何度も繰り返した後にこのプロンプトがまだ表示される場合は、この問題に戻って私たちを養い、我々はそれを解決するために最善を尽くします、ありがとうございました
zh_cn: 保存结果时出现问题，请重试。若重试多次后依旧出现这条提示，请将此问题反馈给我们，我们会尽力解决，谢谢
zh_hant: 請點擊上面的圖片選擇要進行解密的檔

# String16
source: Save successful
de: Speichern erfolgreich
ja_jp: 正常に保存されました
zh_cn: 保存成功
zh_hant: 儲存成功

# String17
source: Please encrypt/decrypt first
de: Bitte zuerst verschlüsseln/entschlüsseln
ja_jp: 最初に暗号化/復号化してください
zh_cn: 请先进行加密/解密
zh_hant: 請先進行加密/解密

# String18
source: Congratulations, the key length has reached the required 40 characters
de: Herzlichen Glückwunsch, die Schlüssellänge hat die erforderlichen 40 Zeichen erreicht
ja_jp: おめでとうございます、キーの長さは必要な40文字に達しました
zh_cn: 恭喜你，密匙长度已经达到要求的40个字符
zh_hant: 恭喜你，密匙長度已經達到要求的40個字元

# String19
source: Congratulations, the key length has reached the required 40 characters
de: Herzlichen Glückwunsch, die Schlüssellänge hat die erforderlichen 40 Zeichen erreicht
ja_jp: おめでとうございます、キーの長さは必要な40文字に達しました
zh_cn: 恭喜你，密匙长度已经达到要求的40个字符
zh_hant: 恭喜你，密匙長度已經達到要求的40個字元

# String2
source: The length of the key must be 40, please check the key
de: Die Länge des Schlüssels muss 40 sein, überprüfen Sie bitte den Schlüssel
ja_jp: キーの長さは40でなければなりませんので、鍵を確認してください
zh_cn: 密匙长度必须是40，请核对密匙
zh_hant: 密匙長度必須是40，請核對密匙

# String20
source: Password is too long, should be between 0 to 20 characters
de: Das Kennwort ist zu lang, sollte zwischen 0 und 20 Zeichen liegen
ja_jp: パスワードが長すぎる、0 ~ 20 文字の間にする必要があります
zh_cn: 密码过长，应在0~20字符之间
zh_hant: 密碼過長，應在0~20字元之間

# String21
source: Your passwords do not match
de: Ihre Kennwörter stimmen nicht überein.
ja_jp: パスワードが一致しません
zh_cn: 两次输入的密码不一致
zh_hant: 您的密碼不符

# String3
source: When setting a password, make sure that the password entered twice is the same and is less than 60 characters long
de: Stellen Sie beim Festlegen eines Kennworts sicher, dass das zweimal eingegebene Kennwort identisch ist und weniger als 60 Zeichen lang ist.
ja_jp: パスワードを設定する場合は、2 回入力したパスワードが同じで、60 文字未満であることを確認します。
zh_cn: 设置密码时，请确保两次输入的密码一致，且长度小于60个字符
zh_hant: 設置密碼時，請確保兩次輸入的密碼一致，且長度小於60個字元

# String4
source: When there is a problem with encryption, please make sure that the encryption key, encryption mode, encryption algorithm is correct, check again. If you've seen this tip many times, please report this question to us in the Feedback Center, thank you
de: Wenn es ein Problem mit der Verschlüsselung gibt, stellen Sie bitte sicher, dass der Verschlüsselungsschlüssel, der Verschlüsselungsmodus, der Verschlüsselungsalgorithmus korrekt ist, überprüfen Sie erneut. Wenn Sie diesen Tipp schon oft gesehen haben, melden Sie uns diese Frage bitte im Feedback Center, danke
ja_jp: 暗号化に問題がある場合は、暗号化キー、暗号化モード、暗号化アルゴリズムが正しいことを確認し、もう一度確認してください。 このヒントを何度も見たことがある場合は、フィードバックセンターでこの質問を報告してください。
zh_cn: 加密时出现问题，请确保加密密匙，加密模式，加密算法的正确性，核对后请重试。如果你看到过这个提示很多次，请在反馈中心把这个问题报告给我们，谢谢
zh_hant: 加密時出現問題，請確保加密密匙，加密模式，加密演算法的正確性，核對後請重試。 如果你看到過這個提示很多次，請在回饋中樞把這個問題報告給我們，謝謝

# String5
source: Encryption was successful, click on the picture below to save
de: Verschlüsselung war erfolgreich, klicken Sie auf das Bild unten, um zu speichern
ja_jp: 暗号化に成功しました, 保存するには、下の写真をクリックしてください
zh_cn: 加密成功，点击下面的图片保存
zh_hant: 加密成功，點擊下面的圖片保存

# String6
source: Please click on the image above to select the file to encrypt.
de: Bitte klicken Sie auf das Bild oben, um die zu verschlüsselnde Datei auszuwählen.
ja_jp: 上の画像をクリックして、暗号化するファイルを選択してください。
zh_cn: 请点击上面的图片选择要进行加密的文件。
zh_hant: 請點擊上面的圖片選擇要進行加密的檔。

# String7
source: Application with out of memory cannot decrypt files larger than (390MB), stay tuned for subsequent updates
de: Anwendung mit Nicht-Arbeitsspeicher kann Dateien größer als (390MB) nicht entschlüsseln, bleiben auf nachfolgende Updates eingestellt
ja_jp: メモリ不足のアプリケーションは、(390MB)より大きいファイルを復号化することはできません、その後の更新にご期待ください
zh_cn: 应用内存不足无法解密大于（390MB）的文件，敬请期待后续更新
zh_hant: 應用記憶體不足無法解密大於（390MB）的檔，敬請期待後續更新

# String8
source: The length of the key must be 40, please check the key
de: Die Länge des Schlüssels muss 40 sein, überprüfen Sie bitte den Schlüssel
ja_jp: キーの長さは40でなければなりませんので、鍵を確認してください
zh_cn: 密匙长度必须是40，请核对密匙
zh_hant: 密匙長度必須是40，請核對密匙

# String9
source: When entering a password, make sure that the password is entered twice and is less than 60 characters long
de: Stellen Sie bei der Eingabe eines Kennworts sicher, dass das Kennwort zweimal eingegeben wird und weniger als 60 Zeichen lang ist.
ja_jp: パスワードを入力する場合は、パスワードを 2 回入力し、60 文字未満であることを確認します。
zh_cn: 输入密码时，请确保两次输入的密码一致，且长度小于60个字符
zh_hant: 輸入密碼時，請確保兩次輸入的密碼一致，且長度小於60個字元

# textblock2.Text
source: 1.3.711 Version Encryption/Decrypt
de: 1.3.711 Versionsverschlüsselung/-entschlüsselung
ja_jp: 1.3.711 バージョン暗号化/復号化
zh_cn: 1.3.711版本 加密/解密
zh_hant: 1.3.711版本 加密/解密

# textblock3.Text
source: Files that need to be encrypted/decrypted
de: Dateien, die verschlüsselt/entschlüsselt werden müssen
ja_jp: 1.3.711 バージョン暗号化/復号化 ...
zh_cn: 需要加密/解密的文件
zh_hant: 需要加密/解密的檔

# textblock5.Text
source: Note: To add a password to a file, change the encryption/decryption mode to normal mode. Since the key is made up of 40 0s or 1s, it's easy to misread, so the default key is recommended. And in most cases, encryption/decryption keys and algorithmic errors cannot be detected and are only discovered by you when you are using files. There are multiple /u008 characters at the end of some of the decrypted files, and our extensive testing shows that this will not affect usage, please be assured.
de: Hinweis: Um einer Datei ein Kennwort hinzuzufügen, ändern Sie den Verschlüsselungs-/Entschlüsselungsmodus in den normalen Modus. Da der Schlüssel aus 40 0s oder 1s besteht, ist er leicht falsch zu lesen, daher wird der Standardschlüssel empfohlen. Und in den meisten Fällen können Verschlüsselungs-/Entschlüsselungsschlüssel und algorithmische Fehler nicht erkannt werden und werden nur von Ihnen erkannt, wenn Sie Dateien verwenden. Es gibt mehrere /u008 Zeichen am Ende einiger der entschlüsselten Dateien, und unsere umfangreichen Tests zeigen, dass dies nicht die Verwendung beeinflussen wird, bitte sicher sein.
ja_jp: 注: ファイルにパスワードを追加するには、暗号化/復号化モードを通常モードに変更します。 キーは 40 0 または 1 で構成されているので、読み間違いやすいので、既定のキーをお勧めします。 また、ほとんどの場合、暗号化/復号化キーとアルゴリズム エラーは検出できず、ファイルを使用している場合にのみ検出されます。 復号化されたファイルの末端には複数の /u008 文字があり、広範なテストでは使用に影響を与えないことが示されています。
zh_cn: 注意：若要给文件添加密码，请更改加密/解密模式为 普通模式 。由于密匙是40个0或1组成的，很容易看错，所以建议使用默认密匙。且在大部分情况下，加密/解密密匙和算法错误无法检测到，只有在使用文件时才会被你发现。部分被解密的文件的末尾存在多个/u008字符，我们大量的测试表明这不会影响使用，请放心。
zh_hant: 注意：若要給檔添加密碼，請更改加密/解密模式為 普通模式 。 由於密匙是40個0或1組成的，很容易看錯，所以建議使用預設密匙。 且在大部分情況下，加密/解密密匙和演算法錯誤無法檢測到，只有在使用檔時才會被你發現。 部分被解密的檔的末尾存在多個/u008字元，我們大量的測試表明這不會影響使用，請放心。

# textblock7.Text
source: Results here, click Save
de: Ergebnisse hier, klicken Sie auf Speichern
ja_jp: 結果はこちらの場合、[保存] をクリックします。
zh_cn: 结果在这，点击保存
zh_hant: 結果在這，點擊保存

# textbox2.Header
source: Custom key:
de: Benutzerdefinierter Schlüssel:
ja_jp: カスタム キー：
zh_cn: 自定义密匙：
zh_hant: 自訂密匙：

# textbox2.PlaceholderText
source: Click on the button below to enter the key
de: Klicken Sie auf die Schaltfläche unten, um den Schlüssel einzugeben
ja_jp: 下のボタンをクリックしてキーを入力します。
zh_cn: 点击下面的按钮输入密匙
zh_hant: 點擊下面的按鈕輸入密匙

# textbox3.Header
source: password
de: Kennwort
ja_jp: パスワード
zh_cn: 密码：
zh_hant: 密碼

# textbox3.PlaceholderText
source: Set an encrypted password, or enter a decryption password
de: Festlegen eines verschlüsselten Kennworts oder Eingeben eines Entschlüsselungskennworts
ja_jp: 暗号化されたパスワードを設定するか、復号化パスワードを入力します。
zh_cn: 设置加密密码，或输入解密密码
zh_hant: 設置加密密碼，或輸入解密密碼

# textbox4.Header
source: Confirm password
de: Kennwort wiederholen
ja_jp: パスワードの再入力
zh_cn: 确认密码：
zh_hant: 確認密碼

# textbox4.PlaceholderText
source: Enter the encryption/decryptpassword again
de: Geben Sie das Verschlüsselungs-/Entschlüsselungskennwort erneut ein.
ja_jp: 暗号化/復号化パスワードをもう一度入力します。
zh_cn: 再次输入加密/解密密码
zh_hant: 再次輸入加密/解密密碼
